app/views/recipes/_recipe.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      <% else %>
        <h6>By: <%= User.find_by(id: recipe.user_id).name %></h6>