app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "apple"], ["measurement_unit", "grams"], ["price", 27.7], ["user_id", 1], ["created_at", "2022-05-17 11:49:11.988552"], ["updated_at", "2022-05-17 11:49:11.988552"]]
---
  def create
    @food = Food.new(food_params)
    @food.user_id = current_user.id
    respond_to do |format|
      if @food.save

UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "orange"], ["updated_at", "2022-05-17 12:37:21.143214"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food.destroy