app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  def public
    @recipes = Recipe.where(public: true)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---
  def index
    @recipes = Recipe.where(user_id: current_user.id)

INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "decription", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id

    respond_to do |format|
      if @recipe.save